{
  "seminars": [
    {
      "id": "1",
      "name": "From Noise To Data: A Tutorial On Diffusion Models",
      "short_abstract": "Diffusion models are a powerful generative framework that transforms complex data into simple distributions through a forward noise process and generates data via a learned reverse denoising process. This tutorial presents a first-principles introduction to discrete-time diffusion models, covering training objectives, parameterization, and sampling methods. It emphasizes intuition and theoretical connections to equip readers to critically engage with current research and applications.",
      "full_content": "Diffusion models have recently emerged as a powerful and unifying framework for generative modeling, achieving state-of-the-art performance across a wide range of domains including images, audio, and structured signals. This tutorial offers a systematic introduction to diffusion models, developed from first principles and requiring only a basic background in probability and estimation. We begin by describing the forward process which transforms complex data distributions into simple reference distributions, such as a Gaussian, through a sequence of noise-injection steps. Generative modeling is described as the reverse diffusion process implemented as a sequence of denoising operations.\n\n The tutorial focuses on discrete-time diffusion models and their algorithmic realization, including training objectives, parameterization choices, and sampling procedures. Throughout, we emphasize intuition, modeling assumptions, and computational considerations, and draw connections to classical ideas in estimation theory and probability. The aim is to equip students with a clear conceptual understanding of diffusion models, enabling them to read current literature critically and apply these ideas to new scientific and engineering problems.",

      "speaker": "Dr. Krishna Narayanan",
      "profile": "Sanchez Chair Professor in ECE at Texas A&M University",
      "photo": "images/seminars/prof1.jpg",
      "speaker_url": "https://engineering.tamu.edu/electrical/profiles/knarayanan.html",

      "date": "2026-02-02T15:30:00",
      "venue": "Online",
      "thumbnail": "images/seminars/thumbnail-1.png",
      "images": ["images/seminars/pdf-1.jpg"],
      "youtube_url": "https://www.youtube.com/watch/zobzbnH9-YU"
    }
  ]
}
